{"items":[{"title":"2012: Supernova","genres":["Comedy","Sci-Fi","Horror","Action"],"year":2009,"cast":["Brian Krause","Heather McComb","Najarra Townsend"],"runtime":84,"summary":"2012: Supernova is a 2009 direct-to-video science fiction disaster film directed by Anthony Fankhauser and starring Brian Krause, Heather McComb, and Najarra Townsend. It was distributed by The Asylum. As with the previous film, titled 2012: Doomsday is a mockbuster of the Roland Emmerich film 2012 , which was released a month later. It is the second film in the Asylum's 2012 Trilogy though the films have nothing to do with one another. The third film is titled 2012: Ice Age."},{"title":"2BR02B: To Be or Naught to Be","genres":["Horror"],"year":2016,"cast":null,"runtime":18,"summary":"2BR02B: To Be or Naught to Be is a 2016 Canadian short science fiction film directed by Marco Checa Garcia and based on the 1962 short story \"2 B R 0 2 B\" by Kurt Vonnegut. The film was an international collaboration over nearly three years, with additional crew in Sydney, London, Mexico, and the Netherlands. The film features a cameo voice role by veteran actor and The X-Files star William B. Davis. The film's sound was designed by BAFTA-winner Martin Cantwell."},{"title":"30 Beats","genres":["Romance","Drama"],"year":2012,"cast":["Condola Rashād","Ingeborga Dapkūnaitė","Vahina Giocante","Paz de la Huerta","Justin Kirk","Lee Grinner Pace","Thomas Sadoski","Jennifer Tilly","Ronald Guttman"],"runtime":88,"summary":"30 Beats is a 2012 comedy romance film, written and directed by Alexis Lloyd and starring Ingeborga Dapkunaite, Jason Day and Vahina Giocante. Acquired by Roadside Attractions in Feb 2012, the film also stars Paz de la Huerta and Lee Pace. Roadside Attractions released the film theatrically and on Video on demand on June 1, 2012."},{"title":"3 Backyards","genres":["Drama"],"year":2010,"cast":["Embeth Davidtz"],"runtime":88,"summary":"3 Backyards is a film written and directed by Eric Mendelsohn and starring Embeth Davidtz. It premiered at the 2010 Sundance Film Festival, where it won the Directing Prize, as did Mendelsohn 's first feature, Judy Berlin ; Mendelsohn is the only director to have won the prize twice.     The independent film was released theatrically by Screen Media Films in March 2011."},{"title":"A Bag of Hammers","genres":["Comedy"],"year":2011,"cast":["Jason Ritter"],"runtime":85,"summary":"A Bag of Hammers is a 2011 American comedy-drama film directed by Brian Crano and written by Crano and Jake Sandvig, who co-stars in the film with Jason Ritter. The soundtrack was written and performed by British folk musician Johnny Flynn."},{"title":"American Son","genres":["Drama"],"year":2008,"cast":["Nick Cannon","Melonie Diaz","Matt O'Leary","Chi McBride","April Grace","Tom Sizemore","Jay Hernández","Michael Welch","Sean Marquette"],"runtime":85,"summary":"American Son is a 2008 drama film directed by Neil Abramson and starring Nick Cannon, Melonie Diaz and Matt O'Leary. The film follows a young man, Mike (Cannon) as he returns home to Bakersfield, California for Thanksgiving leave. Mike faces telling his friends and family of his nearby deployment to Iraq while dealing with a troublesome home life.  It competed in the Dramatic Competition at the 2008 Sundance Film Festival."},{"title":"And the Pursuit of Happiness","genres":["Documentary"],"year":1986,"cast":null,"runtime":80,"summary":"And the Pursuit of Happiness (French: La poursuite du bonheur ) is a 1986 documentary film for television directed by Louis Malle about the experiences of immigrants in the United States during the 1980s. It was originally released as part of HBO's America Undercover series on Independence Day 1986. The film \"appeared at a time when immigrants from Latin America and Asia for the first time outnumbered those coming from Europe\". It was screened in the Un Certain Regard section at the 1987 Cannes Film Festival. It was released on public television in 1988 and won a Peabody Award the following year."},{"title":"Angel and Big Joe","genres":["Drama"],"year":1975,"cast":["Paul Sorvino"],"runtime":27,"summary":"Angel and Big Joe is a 1975 American short drama film directed by Bert Salzman and starring Paul Sorvino and Dadi Pinero. It won an Oscar at the 48th Academy Awards in 1976 for Best Short Subject."},{"title":"Animalympics","genres":["Animation","Comedy"],"year":1979,"cast":null,"runtime":75,"summary":"Animalympics is a 1980 animated television film directed by Steven Lisberger and produced by Lisberger Studios for the NBC network. Originally commissioned as two separate specials, it spoofs the Summer and Winter Olympic Games and features the voices of Billy Crystal, Gilda Radner, Harry Shearer and Michael Fremer."},{"title":"A Nightmare on Elm Street 2: Freddy's Revenge","genres":["Horror","Drama","Thriller"],"year":1985,"cast":["Mark Patton","Kim Myers","Robert Rusler","Clu Gulager","Hope Lange","Robert Englund","Marshall Bell","Lyman Ward","Melinda O. Fee"],"runtime":82,"summary":"A Nightmare on Elm Street 2: Freddy's Revenge (stylized on-screen as A Nightmare on Elm Street Part 2: Freddy's Revenge ) is a 1985 American supernatural slasher film directed by Jack Sholder and written by David Chaskin. It stars Mark Patton, Kim Myers, Robert Englund as Freddy Krueger, and Robert Rusler. It is the second installment in the A Nightmare on Elm Street franchise. The film follows Jesse Walsh, a teenager who begins having recurring nightmares about Freddy Krueger after moving into the former home of Nancy Thompson from the first film.  Freddy's Revenge was released on November 1, 1985, and grossed $30 million at the domestic box office on a budget of $3 million. It received mixed reviews from critics upon release, with many comparing it unfavorably to its predecessor. However, it has enjoyed later success as a cult classic, with critics having reassessed the film's homoerotic themes and subject material. It was distributed by New Line Cinema. The film was followed by A Nightmare on Elm Street 3: Dream Warriors."},{"title":"Aftermath","genres":["Horror","Film-Noir"],"year":1994,"cast":null,"runtime":31,"summary":"Aftermath is a 1994 Spanish horror short film written and directed by Nacho Cerdà. Containing no spoken dialogue, Aftermath is the second installment in a trilogy of shorts by Cerdà, preceded by 1990's The Awakening , and followed by 1998's Genesis."},{"title":"Batman Dracula","genres":["Thriller"],"year":1964,"cast":["Naomi Levine","Gerard Malanga","Taylor Mead","Jack Smith","David Bourdon","Beverly Grant","Sam Green","Jane Holzer","Mario Montez","Ondine","Dorothy Dean"],"runtime":54,"summary":"Batman Dracula is a 1964 black and white American superhero fan film, produced and directed by Andy Warhol, without the permission of DC Comics, who owns the character Batman."},{"title":"Blood Trails","genres":["Horror","Thriller"],"year":2006,"cast":["Ben Price"],"runtime":87,"summary":"Blood Trails is a 2006 German horror film written and directed by Robert Krause, and co-written by Florian Puchert. It stars Ben Price, Tom Frederic, and Rebecca Palmer."},{"title":"Before I Sleep","genres":["Drama"],"year":2013,"cast":["Bonnie Wright","Campbell Scott","Chevy Chase","Cynthia Gibb","David Warner","Eric Roberts","Eugène Simon","James Rebhorn","Jamie Bamber","Tom Sizemore"],"runtime":82,"summary":"Before I Sleep is a 2013 American drama film co-directed, written and produced by Aaron Sharff and Billy Sharff. The film features David Warner, Tom Sizemore, Bonnie Wright, Cynthia Gibb, Eric Roberts, Eugene Simon, Campbell Scott and Chevy Chase. It was formerly titled Shakespeare's Daughter. The film premiered in competition at the Heartland Film Festival on October 19, 2013. The film marks the final film appearance of James Rebhorn before his death."},{"title":"Beyond Imagining: Margaret Anderson and the 'Little Review'","genres":["Documentary"],"year":1992,"cast":["Margaret Caroline Anderson"],"runtime":30,"summary":"Beyond Imagining: Margaret Anderson and the 'Little Review' is a 1992 American short documentary film about Margaret Caroline Anderson, produced by Wendy L. Weinberg. It was nominated for an Academy Award for Best Documentary Short."},{"title":"Big Font. Large Spacing","genres":["Drama","Family","Comedy"],"year":2010,"cast":null,"runtime":80,"summary":"Big Font. Large Spacing is a 2010 British comedy film directed by Paul Howard Allen. Set in Cardiff, the film tells the story of a night in the life of two psychology students who find out that the term's major essay is due in the next morning. The film was toured around British universities on a touring cinema over three years during the freshers week period."},{"title":"Birth of the Living Dead","genres":["Documentary","Thriller"],"year":2012,"cast":null,"runtime":76,"summary":"Birth of the Living Dead (sometimes known by its working title Year of the Living Dead ) is a 2012 American documentary film directed by Rob Kuhns. It is about the 1968 horror film Night of the Living Dead and that film's legacy. It features interviews with Night of the Living Dead director George A. Romero, Elvis Mitchell, Jason Zinoman, Larry Fessenden, Gale Anne Hurd, and Mark Harris."},{"title":"Automatons","genres":["Sci-Fi"],"year":2006,"cast":["Angus Scrimm"],"runtime":83,"summary":"Automatons is a 2006 black-and-white horror film directed by James Felix McKenney, and starring Christine Spencer, Angus Scrimm, and Brenda Cooney. John Levene, Don Wood and Executive Producer Larry Fessenden have supporting roles. The plot is about a war against robots. The movie was made under the working title Death to the Automatons."},{"title":"But I'm a Cheerleader","genres":["Romance","Drama","Family"],"year":1999,"cast":["Natasha Lyonne","Cathy Moriarty","RuPaul","Clea DuVall","Bud Cort","Melanie Lynskey","Dante Basco","Eddie Cibrian","Joel Michaely","Julie Delpy","Katharine Towne","Kip Pardue","Michelle Williams","Mink Stole","Douglas Spain","Ione Skye"],"runtime":89,"summary":"But I'm a Cheerleader is a 1999 American satirical romantic comedy film directed by Jamie Babbit and written by Brian Wayne Peterson. Natasha Lyonne stars as Megan Bloomfield, a high school cheerleader whose parents send her to a residential inpatient conversion therapy camp to cure her lesbianism. There, Megan soon comes to embrace her sexual orientation, despite the therapy, and falls in love. The supporting cast includes Joel Michaely, Melanie Lynskey, Dante Basco, Eddie Cibrian, Clea DuVall, Cathy Moriarty, Katrina Phillips, RuPaul, Richard Moll, Mink Stole, Kip Pardue, Michelle Williams, and Bud Cort.  But I'm a Cheerleader was Babbit's first feature film. It was inspired by an article about conversion therapy and her childhood familiarity with rehabilitation programs. She used the story of a young woman finding her sexual identity to explore the social construction of gender roles and heteronormativity. The costume and set design of the film highlighted these themes using artificial textures in intense blues and pinks.  When it was initially rated as NC-17 by the Motion Picture Association of America (MPAA), Babbit made cuts to allow it to be re-rated as R. When interviewed in the documentary film This Film Is Not Yet Rated Babbit criticized the MPAA for discriminating against films with gay content.  Many critics did not like the film, comparing it unfavorably with the films of John Waters and criticizing the colorful production design. Although the lead actors were praised for their performances, some of the characters were described as stereotypical. The film has since garnered a cult following."},{"title":"Change of Our Lives","genres":["Unknown"],"year":2013,"cast":null,"runtime":60,"summary":"Change of Our Lives is a 2013 Australian feature film using comedy and drama to demystify hepatitis B, its myths and misconceptions and set in the backdrops of the suburb of Cabramatta. It was produced and directed by Maria Tran that was commissioned by Cancer Council and Information and Cultural Exchange (ICE)."},{"title":"Chasing 3000","genres":["Sport","Family"],"year":2008,"cast":["Trevor Morgan","Rory Culkin","Ray Liotta","Lauren Holly","Tania Raymonde","Willa Holland","Seymour Cassel","Ricardo Antonio Chavira"],"runtime":84,"summary":"Chasing 3000 is a 2007 American independent film chronicling the cross- country travel of two brothers to see the 3,000th base hit of Major League Baseball legend Roberto Clemente. It stars Trevor Morgan, Rory Culkin, Ray Liotta, and Lauren Holly. The film was originally meant to premiere at the 2006 Major League Baseball All-Star Game, but its release was delayed until April 2007."},{"title":"Blue Jay","genres":["Drama","Romance"],"year":2016,"cast":["Mark Duplass","Sarah Paulson","Clu Gulager"],"runtime":80,"summary":"Blue Jay is a romantic drama film directed by Alex Lehmann in his fictional feature debut, from a screenplay by Mark Duplass. It stars Duplass and Sarah Paulson. The film had its world premiere at the Toronto International Film Festival on September 12, 2016.  The film was released on October 7, 2016, in a limited release prior to being released through video on demand on October 11, 2016."},{"title":"Border Radio","genres":["Adventure","Drama"],"year":1987,"cast":["Chris D."],"runtime":87,"summary":"Border Radio is a 1987 independent film directed by Allison Anders, Dean Lent and Kurt Voss."},{"title":"Born to Be Wild","genres":["Documentary"],"year":2011,"cast":["Morgan Freeman","Birutė Galdika","Daphne Sheldrick"],"runtime":40,"summary":"Born to Be Wild is a 2011 American nature documentary short film about orphaned orangutans and elephants. It was directed by David Lickley, written and produced by Drew Fellman. It was distributed in the United States by Warner Bros. Pictures and IMAX Pictures. The film was released April 8, 2011, and is narrated by Morgan Freeman. There was a Premiere of the film in Montreal, Quebec on March 30, 2011, at 9:30 AM at the Montreal Science Centre IMAX Telus Theatre for Two Montreal Primary schools and two secondary schools.  In March 2012, it won the Genesis Award for Best Documentary Feature from The Humane Society of the United States \"for its celebration of the people rehabilitating baby elephants and orangutans orphaned by poaching and habitat encroachment.\""},{"title":"Breath","genres":["Drama","Crime"],"year":2007,"cast":["Kim Ki-duk","Park Ji-a","Chang Chen","Ha Jung-woo"],"runtime":84,"summary":"Breath (숨, Soom ) is the fourteenth feature film by South Korean director Kim Ki-duk."}],"hasMore":true,"limit":25,"offset":0,"count":25,"links":[{"rel":"self","href":"https://gf641ea24ecc468-moviestream23ai.adb.us-ashburn-1.oraclecloudapps.com/ords/admin/results_view/?q=%7B%22runtime%22:%7B%22%24lt%22:90%7D%7D"},{"rel":"describedby","href":"https://gf641ea24ecc468-moviestream23ai.adb.us-ashburn-1.oraclecloudapps.com/ords/admin/metadata-catalog/results_view/"},{"rel":"first","href":"https://gf641ea24ecc468-moviestream23ai.adb.us-ashburn-1.oraclecloudapps.com/ords/admin/results_view/?q=%7B%22runtime%22:%7B%22%24lt%22:90%7D%7D"},{"rel":"next","href":"https://gf641ea24ecc468-moviestream23ai.adb.us-ashburn-1.oraclecloudapps.com/ords/admin/results_view/?q=%7B%22runtime%22:%7B%22%24lt%22:90%7D%7D&offset=25"}]}